src/cf/InformationRegisters/УдалитьОчередьПриемаСообщенийЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьОчередьПриемаСообщенийЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СообщениеЭДО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьОчередьПриемаСообщенийЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись.
//
Процедура ДобавитьЗапись(СообщениеЭДО) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.УдалитьОчередьПриемаСообщенийЭДО");
	ЭлементБлокировки.УстановитьЗначение("СообщениеЭДО", СообщениеЭДО);
	БлокировкаДанных.Заблокировать();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СообщениеЭДО = СообщениеЭДО;
	Запись.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ДобавитьПопыткуОбработки(СообщениеЭДО) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.УдалитьОчередьПриемаСообщенийЭДО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СообщениеЭДО = СообщениеЭДО;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.КоличествоПопытокОбработки =
			МенеджерЗаписи.КоличествоПопытокОбработки + 1;
		МенеджерЗаписи.Записать();
		
		Возврат МенеджерЗаписи.КоличествоПопытокОбработки;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Удаляет запись.
//
Процедура УдалитьЗапись(СообщениеЭДО) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.УдалитьОчередьПриемаСообщенийЭДО");
	ЭлементБлокировки.УстановитьЗначение("СообщениеЭДО", СообщениеЭДО);
	БлокировкаДанных.Заблокировать();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СообщениеЭДО = СообщениеЭДО;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
